{"convertedBy": "TensorFlow.js Converter v1.7.4r1", "generatedBy": "keras v2.3.0-tf", "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 96, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 160], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [160], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 160, 192], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [192], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 192, 224], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [224], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 224, 256], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32"}, {"name": "output/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "output/bias", "shape": [1], "dtype": "float32"}], "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]}], "format": "layers-model", "modelTopology": {"backend": "tensorflow", "training_config": {"loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "learning_rate": 7.427357923006639e-05, "beta_1": 0.8999999761581421, "name": "Adam", "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss": {"config": {"name": "binary_crossentropy", "label_smoothing": 0, "from_logits": false, "reduction": "auto"}, "class_name": "BinaryCrossentropy"}, "weighted_metrics": null}, "keras_version": "2.3.0-tf", "model_config": {"config": {"name": "model", "layers": [{"name": "input", "config": {"name": "input", "batch_input_shape": [null, 512, 512, 1], "sparse": false, "ragged": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["input", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_1", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_1", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_1", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_1", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_2", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 96, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_2", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_2", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_2", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_2", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_3", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_3", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_3", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_3", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_3", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_4", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 160, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_4", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_4", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_4", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_4", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_4", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_5", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 192, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_5", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_5", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_5", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_5", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_6", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 224, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_6", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_6", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_6", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_6", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_6", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_7", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "maxpool2d_7", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "maxpool2d_7", "padding": "valid", "strides": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_7", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_7", "dtype": "float32"}, "inbound_nodes": [[["maxpool2d_7", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "global_average_pooling2d", "config": {"name": "global_average_pooling2d", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D"}, {"name": "output", "config": {"units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "output", "dtype": "float32", "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["output", 0, 0]], "input_layers": [["input", 0, 0]]}, "class_name": "Model"}}}